Tekla Open API Reference for Tekla Structures 2025
Operation.IFCExportFlags.IsPoursEnabled Field
 Pours export is enabled. True for pours, false for CIP cast-units and/or parts
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsPoursEnabled
Public IsPoursEnabled As Boolean
Field Value
Type: Boolean
See Also
Reference
Operation.IFCExportFlags Structure
Tekla.Structures.Model.Operations Namespace